In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [12]:
inputs = df.drop('salary_more_then_100k', axis='columns')
outputs = df['salary_more_then_100k']

In [13]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [14]:
outputs.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [17]:
inputs['comapny_le'] = le_company.fit_transform(inputs['company'])
inputs['job_le'] = le_job.fit_transform(inputs['job'])
inputs['degree_le'] = le_degree.fit_transform(inputs['degree'])

In [18]:
inputs.head()

  company                  job     degree  comapny_le  job_le  degree_le
0  google      sales executive  bachelors           2       2          0
1  google      sales executive    masters           2       2          1
2  google     business manager  bachelors           2       0          0
3  google     business manager    masters           2       0          1
4  google  computer programmer  bachelors           2       1          0

In [19]:
inputs_n = inputs.drop(['company','job','degree'], axis='columns')
inputs_n

    comapny_le  job_le  degree_le
0            2       2          0
1            2       2          1
2            2       0          0
3            2       0          1
4            2       1          0
5            2       1          1
6            0       2          1
7            0       1          0
8            0       0          0
9            0       0          1
10           1       2          0
11           1       2          1
12           1       0          0
13           1       0          1
14           1       1          0
15           1       1          1

In [20]:
from sklearn import tree

In [21]:
model = tree.DecisionTreeClassifier()

In [22]:
model.fit(inputs_n,outputs)
#Havent split the dataset to make it simple, but it should be splitted

DecisionTreeClassifier()

In [23]:
model.score(inputs_n,outputs) #we used the actual dataset and dataset was simple so accuracy achieved is 1

1.0

In [24]:
model.predict([[2,2,1]])

D:\Raptor\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

# Exercise

In [38]:
titanic_df = pd.read_csv('titanic.csv')

In [39]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

We have to consider only the Survived,Pclass,Sex,Age and Fare for our exercise.

In [50]:
inp = titanic_df[['Pclass','Sex','Age','Fare']]
target = titanic_df['Survived']

In [51]:
inp.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [52]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

The input features have one textual categorical variable that is Sex. It is nominal and hence we can simply Label Encode it and perform our Decision Tree Task

In [53]:
from sklearn.preprocessing import LabelEncoder

In [54]:
le = LabelEncoder()

In [55]:
inp['Sex_le'] = le.fit_transform(inp['Sex'])

<ipython-input-55-9b600048a44a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inp['Sex_le'] = le.fit_transform(inp['Sex'])

In [56]:
inp.head()

   Pclass     Sex   Age     Fare  Sex_le
0       3    male  22.0   7.2500       1
1       1  female  38.0  71.2833       0
2       3  female  26.0   7.9250       0
3       1  female  35.0  53.1000       0
4       3    male  35.0   8.0500       1

In [57]:
inp_n = inp.drop('Sex', axis='columns')

In [58]:
inp_n.head()

   Pclass   Age     Fare  Sex_le
0       3  22.0   7.2500       1
1       1  38.0  71.2833       0
2       3  26.0   7.9250       0
3       1  35.0  53.1000       0
4       3  35.0   8.0500       1

In [66]:
inp_n.isna().sum()

Pclass      0
Age       177
Fare        0
Sex_le      0
dtype: int64

In [72]:
inp_n = inp_n.fillna(method='ffill')

In [74]:
inp_n.isna().sum()

Pclass    0
Age       0
Fare      0
Sex_le    0
dtype: int64

In [59]:
from sklearn import tree

In [60]:
dc = tree.DecisionTreeClassifier()

In [62]:
from sklearn.model_selection import train_test_split

In [75]:
X_train, X_test, y_train, y_test= train_test_split(inp_n, target, test_size=0.3, random_state=42)

In [76]:
dc.fit(X_train,y_train)

DecisionTreeClassifier()

In [77]:
y_pred = dc.predict(X_test)

In [78]:
from sklearn.metrics import accuracy_score

In [81]:
accuracy = accuracy_score(y_test,y_pred)

In [82]:
print("Accuracy of Decision Tree Model: ", accuracy)

Accuracy of Decision Tree Model:  0.75